<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Webex Meetings disk image.</string>
    <key>Identifier</key>
    <string>ch.fabianhartmann.download.webexmeetings</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>WebexMeetings</string>
        <key>DOWNLOAD_URL</key>
        <string>http://www.webex.com/downloads/WebexTeams.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Webex Teams.app</string>
                <key>strict_verification</key>
                <false/>
                <key>expected_authority_names</key>
                <array>
                	<string>Developer ID Installer: Joel Rennich (AAPZK3CB24)</string>
                	<string>Developer ID Certification Authority</string>
            		  <string>Apple Root CA</string>
            	</array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
