<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest JRE 8 from Oracle.</string>
    <key>Identifier</key>
    <string>com.fabianhartmann.download.OracleJRE8</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Java_SE_Runtime_Environment_8</string>
        <key>SEARCH_URL</key>
        <string>http://www.oracle.com/technetwork/java/javase/downloads/jre8-downloads-2133155.html</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;http://download.oracle.com/otn-pub/java/jdk/.*?/jre-8.*?x64.dmg)</string>
        <key>ORACLE_LICENSE_COOKIE</key>
        <string>oraclelicense=accept-securebackup-cookie</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>request_headers</key>
                <dict>
                        <key>Cookie</key>
                        <string>%ORACLE_LICENSE_COOKIE%</string>
                </dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Java 8 Update *.app</string>
                <key>requirement</key>
                <string>anchor apple generic and certificate leaf[subject.OU] = "VB5E2TV963"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
