<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest Java 8 JDK from Oracle and creates a PKG.</string>
    <key>Identifier</key>
    <string>com.fabianhartmann.pkg.OracleJDK8</string>
    <key>ParentRecipe</key>
    <string>com.fabianhartmann.download.OracleJDK8</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Oracle_Java_SE_Development_Kit_8</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>FlatPkgUnpacker</string>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack</string>
          <key>flat_pkg_path</key>
          <string>%pathname%/JDK 8 Update *.pkg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>FileFinder</string>
        <key>Arguments</key>
        <dict>
          <key>pattern</key>
          <string>%RECIPE_CACHE_DIR%/unpack/jdk*.pkg/Payload</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgPayloadUnpacker</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_payload_path</key>
          <string>%found_filename%</string>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/jdk</string>
          <key>purge_destination</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PlistReader</string>
        <key>Arguments</key>
        <dict>
          <key>info_path</key>
          <string>%RECIPE_CACHE_DIR%/jdk/Contents/Info.plist</string>
          <key>plist_keys</key>
          <dict>
            <key>CFBundleVersion</key>
            <string>version</string>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgCopier</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
          <key>source_pkg</key>
          <string>%pathname%/JDK 8 Update *.pkg</string>
        </dict>
      </dict>
      <dict>
  			<key>Arguments</key>
  			<dict>
  				<key>path_list</key>
  				<array>
  					<string>%RECIPE_CACHE_DIR%/jdk</string>
            <string>%RECIPE_CACHE_DIR%/unpack</string>
  				</array>
  			</dict>
  			<key>Processor</key>
  			<string>PathDeleter</string>
  		</dict>
    </array>
  </dict>
</plist>
