<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest Java 9 JRE from Oracle and creates a PKG.</string>
    <key>Identifier</key>
    <string>com.fabianhartmann.pkg.OracleJRE9</string>
    <key>ParentRecipe</key>
    <string>com.fabianhartmann.download.OracleJRE9</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Java_SE_Runtime_Environment_9</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>Copier</string>
        <key>Arguments</key>
        <dict>
          <key>source_path</key>
          <string>%pathname%/Java 9*.app</string>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/AppContent</string>
        </dict>
      </dict>
      <dict>
        <key>Comment</key>
        <string>Get Java version from the app</string>
        <key>Processor</key>
        <string>Versioner</string>
        <key>Arguments</key>
        <dict>
          <key>input_plist_path</key>
          <string>%RECIPE_CACHE_DIR%/AppContent/Contents/Info.plist</string>
          <key>plist_version_key</key>
          <string>CFBundleVersion</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgCopier</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
          <key>source_pkg</key>
          <string>%RECIPE_CACHE_DIR%/AppContent/Contents/Resources/JavaAppletPlugin.pkg</string>
        </dict>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>path_list</key>
          <array>
            <string>%RECIPE_CACHE_DIR%/AppContent</string>
          </array>
        </dict>
        <key>Processor</key>
        <string>PathDeleter</string>
      </dict>
    </array>
  </dict>
</plist>
