<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for ClickShare Launcher.</string>
        <key>Identifier</key>
        <string>ch.appfruit.download.ClickShareDesktopApp</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>ClickShareDesktopApp</string>
            <key>URL</key>
            <string>https://www.barco.com/en/Support/clickshare%20cs-100/drivers</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%URL%</string>
                    <key>re_pattern</key>
                    <string>:&amp;quot;ClickShare Desktop App Mac&amp;quot;,&amp;quot;downloadUrl&amp;quot;:&amp;quot;(?P&lt;rel_url&gt;.*?)&amp;quot;,&amp;quot;icon&amp;quot;:&amp;quot;fa-file-zip-o&amp;quot;,&amp;quot;url&amp;quot;:&amp;quot;.*?&amp;quot;,&amp;quot;version&amp;quot;:&amp;quot;v(?P&lt;version&gt;[0-9\.]+)&amp;quot;</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://www.barco.com%rel_url%</string>
                    <key>filename</key>
                    <string>%NAME%.zip</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>archive_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.zip</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.zip</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/*ApplicationSw/ClickShare_Setup.dmg</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
                <key>Processor</key>
                <string>Copier</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/ClickShare_Setup.dmg/ClickShare.app</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/ClickShare.app</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
                <key>Processor</key>
                <string>Copier</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/ClickShare_Setup.dmg/Soundflower.pkg</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Soundflower.pkg</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
                <key>Processor</key>
                <string>Copier</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/ClickShare.app</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Barco NV (P6CDJZR997)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
