<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads ClickShareLauncher and creates a package.</string>
        <key>Identifier</key>
        <string>ch.appfruit.pkg.ClickShareDesktopApp</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>ClickShareDesktopApp</string>
            <key>PKG_ID</key>
            <string>com.barco.clicksharedesktopapp</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>ch.appfruit.download.ClickShareDesktopApp</string>
        <key>Process</key>
        <array>
          <dict>
              <key>Processor</key>
              <string>PkgRootCreator</string>
              <key>Arguments</key>
              <dict>
                  <key>pkgroot</key>
                  <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                  <key>pkgdirs</key>
                  <dict>
                      <key>Applications</key>
                      <string>0775</string>
                  </dict>
              </dict>
          </dict>
          <dict>
              <key>Arguments</key>
              <dict>
                  <key>source_path</key>
                  <string>%RECIPE_CACHE_DIR%/%NAME%/ClickShare_Setup.dmg/ClickShare.app</string>
                  <key>destination_path</key>
                  <string>%pkgroot%/Applications/ClickShare.app</string>
                  <key>purge_destination</key>
                  <true/>
              </dict>
              <key>Processor</key>
              <string>Copier</string>
          </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/ClickShare.app/Contents/Info.plist</string>
                </dict>
                <key>Processor</key>
                <string>Versioner</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>pkgroot</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                        <key>pkgdir</key>
                        <string>%RECIPE_CACHE_DIR%</string>
                        <key>pkgname</key>
                        <string>%NAME%</string>
                        <key>id</key>
                        <string>%PKG_ID%</string>
                        <key>version</key>
                        <string>%version%</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
        </array>
    </dict>
</plist>
