<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of NoMAD and adds a pre-/post-isntall script to unload NoMAD if used with a LaunchAgent.</string>
	<key>Identifier</key>
	<string>com.fabianhartmann.pkg.NoMAD-LA</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>NoMAD-LaunchAgent</string>
		<key>version</key>
		<string>1.0</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
						<key>pkgroot</key>
						<string>%RECIPE_CACHE_DIR%/%NAME%</string>
						<key>pkgdirs</key>
						<dict>
								<key>Library</key>
								<string>0775</string>
								<key>Library/LaunchAgents</key>
								<string>0775</string>
						</dict>
				</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>./com.trusourcelabs.NoMAD.plist</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Library/LaunchAgents</string>
			</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<key>Arguments</key>
				<dict>
						<key>pkgname</key>
						<string>%NAME%-%version%</string>
						<key>pkg_request</key>
						<dict>
								<key>pkgdir</key>
								<string>%RECIPE_CACHE_DIR%/%NAME%</string>
								<key>id</key>
								<string>com.fabianhartmann.NoMAD-LaunchAgent.pkg</string>
								<key>options</key>
								<string>purge_ds_store</string>
								<key>scripts</key>
								<string>Scripts</string>
								<key>chown</key>
								<array>
										<dict>
												<key>path</key>
												<string>/Library/LaunchAgents</string>
												<key>user</key>
												<string>root</string>
												<key>group</key>
												<string>wheel</string>
										</dict>
								</array>
						</dict>
				</dict>
		</dict>
	</array>
</dict>
</plist>
