<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest HIN Client</string>
    <key>Identifier</key>
    <string>com.fabianhartmann.download.hinClient2</string>
		<key>ParentRecipe</key>
    <string>com.fabianhartmann.download.hinClient</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>HIN_HIN-Client</string>
        <key>SEARCH_URL</key>
        <string>https://www.hin.ch/download/</string>
        <key>SEARCH_PATTERN</key>
        <string>(https://download.hin.ch/download/distribution/install/.*/HINClient_macos.*.dmg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
				<dict>
						<key>Processor</key>
						<string>Copier</string>
						<key>Arguments</key>
						<dict>
								<key>source_path</key>
								<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Install HIN Client.app/Contents/Resources/HIN Client 2.pkg</string>
								<key>destination_path</key>
								<string>%RECIPE_CACHE_DIR%/downloads/HIN Client 2.pkg</string>
						</dict>
				</dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/HIN Client 2.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Health Info Net AG (FC5A537NX2)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
