<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest HIN Client</string>
    <key>Identifier</key>
    <string>com.fabianhartmann.download.hinClient1</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>HIN_HIN-Client</string>
        <key>SEARCH_URL</key>
        <string>https://www.hin.ch/download/</string>
        <key>SEARCH_PATTERN</key>
        <string>(https://download.hin.ch/download/distribution/install/.*/HINClient_macos.*.dmg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>result_output_var_name</key>
                <string>downloadurl</string>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%downloadurl%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
    				<key>Processor</key>
    				<string>PkgRootCreator</string>
    				<key>Arguments</key>
    				<dict>
    						<key>pkgroot</key>
    						<string>%RECIPE_CACHE_DIR%/%NAME%</string>
    						<key>pkgdirs</key>
    						<dict>
    								<key>tmp</key>
    								<string>0775</string>
    						</dict>
    				</dict>
    		</dict>
				<dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Install HIN Client.app/Contents/Resources/HIN Client Installationsprogramm.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/tmp/HIN Client Installationsprogramm.app</string>
            </dict>
        </dict>
        <dict>
    			<key>Arguments</key>
    			<dict>
    				<key>input_plist_path</key>
    				<string>%pkgroot%/tmp/HIN Client Installationsprogramm.app/Contents/Info.plist</string>
    				<key>plist_version_key</key>
    				<string>CFBundleShortVersionString</string>
    			</dict>
    			<key>Processor</key>
    			<string>Versioner</string>
    		</dict>
        <dict>
    				<key>Processor</key>
    				<string>PkgCreator</string>
    				<key>Arguments</key>
    				<dict>
    						<key>pkgname</key>
    						<string>%NAME%-%version%</string>
    						<key>pkg_request</key>
    						<dict>
    								<key>pkgdir</key>
    								<string>%RECIPE_CACHE_DIR%</string>
    								<key>id</key>
    								<string>ch.hin.hinclient.pkg</string>
    								<key>options</key>
    								<string>purge_ds_store</string>
    								<key>scripts</key>
    								<string>Scripts</string>
    								<key>chown</key>
    								<array>
    										<dict>
    												<key>path</key>
    												<string>tmp</string>
    												<key>user</key>
    												<string>root</string>
    												<key>group</key>
    												<string>wheel</string>
    										</dict>
    								</array>
    						</dict>
    				</dict>
    		</dict>
    </array>
</dict>
</plist>
